# RbsEnergyAnalysisViewShadingSurfacesMode Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsEnergyAnalysisViewShadingSurfacesMode Property
ParameterTypeId Class See Also
---
"Show Shading Surfaces"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsEnergyAnalysisViewShadingSurfacesMode { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsEnergyAnalysisViewShadingSurfacesMode As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsEnergyAnalysisViewShadingSurfacesMode {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace